       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM07.
       AUTHOR. MARIA VICTOR.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 22/06/2020.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS.                  LE O ARQUIVO DE ENTRADA E IMPRIME UM. 
      *                          RELATORIO.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
           SOURCE-COMPUTER. IBM-PC.
           OBJECT-COMPUTER. IBM-PC.
           SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT    CADENT          ASSIGN         TO          DISK
           ORGANIZATION      IS           LINE            SEQUENTIAL.
           SELECT    TRAB            ASSIGN         TO          DISK.
           SELECT    RELTRAN         ASSIGN         TO          DISK.

       DATA DIVISION.
       FILE SECTION.

       FD  CADENT
           LABEL RECORD ARE  STANDARD 
           VALUE        OF   FILE-ID   IS       "CADENT.DAT".

       01  REG-ENT.
	       02 NOME-ENT       PIC X(30).
	       02 DPT-ENT        PIC 9(02).
	       02 TRANS-ENT      PIC 9(04)V99.
           02 DIAS-ENT       PIC 99.

       SD  TRAB.
	   01  REG-TRAB.
	       02 NOME-TRAB   PIC X(30).
           02 VALOR-TRAB  PIC Z.ZZZ.ZZV99.
    
       FD  RELTRAN
	       LABEL         RECORD         IS          OMITTED.

	   01  REG-REL           PIC X(80).

	   WORKING-STORAGE SECTION.

	   77  FIM-ARQ            PIC X(03) VALUE "NAO".
	   77  CT-LIN             PIC 9(02) VALUE 30.
	   77  CT-PAG             PIC 9(02) VALUE ZEROES.
       77  VALORAUX           PIC Z.ZZZ.ZZV99.


	   01  CAB-01.
	       02 FILLER    PIC X(20) VALUE SPACES.
           02 FILLER    PIC X(37) VALUE 
                        "RELACAO DE VALORES DO TRANSPORTE PAGO".
           02 FILLER    PIC X(13) VALUE SPACES.
	       02 FILLER    PIC X(05) VALUE "PAG. ".
	       02 VAR-PAG   PIC ZZ9.
	       02 FILLER    PIC X(02) VALUE SPACES.

	   01  CAB-02.
	       02 FILLER    PIC X(22) VALUE SPACES.
	       02 FILLER    PIC X(30) VALUE 
                                  "PARA TRABALHADOR DO DPTO DE TI".
	       02 FILLER    PIC X(28) VALUE SPACES.
  
       01  CAB-03.
	       02 FILLER    PIC X(05) VALUE SPACES.
	       02 FILLER    PIC X(04) VALUE "NOME".
	       02 FILLER    PIC X(31) VALUE SPACES.
	       02 FILLER    PIC X(10) VALUE "VALOR PAGO".
	       02 FILLER    PIC X(30) VALUE SPACES.

       01  DETALHE.
	       02 FILLER     PIC X(01) VALUE SPACES.
	       02 NOME-SAI   PIC X(30).
	       02 FILLER     PIC X(13) VALUE SPACES.
	       02 VALORP     PIC Z.ZZZ.ZZV99.
	       02 FILLER     PIC X(30) VALUE SPACES.

       PROCEDURE DIVISION.
       PGM-EX07.
           SORT TRAB
	       ASCENDING KEY NOME-TRAB
	       INPUT PROCEDURE ROT-CADENT
	       OUTPUT PROCEDURE ROT-RELTRAN.
           STOP RUN.

       ROT-CADENT SECTION.
	       PERFORM INICIO-ENTRADA.
	       PERFORM PRINCIPAL-ENTRADA
		            UNTIL
		   FIM-ARQ EQUAL "SIM".
	       PERFORM FIM-ENTRADA.

       INICIO-ENTRADA SECTION.
	       OPEN INPUT CADENT.
	       PERFORM LEITURA-ENTRADA.

       LEITURA-ENTRADA SECTION.
	       READ CADENT
	         AT END
	       MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL-ENTRADA SECTION.
	       PERFORM SELECAO-ENTRADA.
	       PERFORM LEITURA-ENTRADA.

	   SELECAO-ENTRADA SECTION.
	       IF DPT-ENT EQUAL 32
	       PERFORM GRAVACAO-ENTRADA.     

	   GRAVACAO-ENTRADA SECTION.
           COMPUTE VALORAUX = ( TRANS-ENT * 2 ) * ( DIAS-ENT ).
	       MOVE NOME-ENT TO NOME-TRAB.
	       MOVE VALORAUX TO VALOR-TRAB.
	       RELEASE REG-TRAB.

	   FIM-ENTRADA SECTION.
	       CLOSE CADENT.

	   ROT-RELTRAN SECTION.
	       PERFORM INICIO-SAIDA.
	       PERFORM PRINCIPAL-SAIDA
	             UNTIL
	       FIM-ARQ EQUAL "SIM".
	       PERFORM FIM-SAIDA.

	   INICIO-SAIDA SECTION.
   	       MOVE "NAO" TO FIM-ARQ.
	       OPEN OUTPUT RELTRAN.
	       PERFORM LE-SAIDA.

	   LE-SAIDA SECTION.
	       RETURN TRAB
 	          AT END
	       MOVE "SIM" TO FIM-ARQ.

	   PRINCIPAL-SAIDA SECTION.
           PERFORM IMPRESSAO-SAIDA.
	       PERFORM LE-SAIDA.

	   IMPRESSAO-SAIDA SECTION.
	       IF CT-LIN GREATER THAN 29
	          PERFORM CABECALHO-SAIDA.
	       PERFORM DETALHE-SAIDA.

	   CABECALHO-SAIDA SECTION.
		   ADD 1           TO CT-PAG.
		   MOVE CT-PAG     TO VAR-PAG.
		   WRITE REG-REL
		   AFTER ADVANCING PAGE.
		   WRITE REG-REL FROM CAB-01 AFTER ADVANCING 2 LINE.
		   WRITE REG-REL FROM CAB-02 AFTER ADVANCING 1 LINE.
		   WRITE REG-REL FROM CAB-03 AFTER ADVANCING 3 LINES.
		   MOVE ZEROES     TO CT-LIN.

	   DETALHE-SAIDA SECTION.
		   MOVE NOME-TRAB  TO NOME-SAI.
		   MOVE VALOR-TRAB TO VALORP.
		   WRITE REG-REL FROM DETALHE AFTER ADVANCING 1 LINE.
		   ADD 1           TO CT-LIN.

	   FIM-SAIDA SECTION.
		   CLOSE RELTRAN.
